OpenFoam Final Project/mach-3-ramp-20-Nx2/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

interpolationScheme cell;

setFormat       raw;

writeControl    writeTime; // this ensures that it's writing only at writeInterval

sets
(

    // make sure to change (x1 y1 z1) and (x2 y2 z2) to
    // the coordinates of the start and end points

    bottomInlet 
    {
        type    lineCell;
        axis    xyz;
        start   (0 1e-6 0);
        end     (0.6 1e-6 0);
    }
   bottomRamp
    {
        type    lineCell;
        axis    xyz;
        start   (0.6 1e-6 0);
        end     (1.1490495 0.200001 0);
    }
   bottomTunnel
    {
        type    lineCell;
        axis    xyz;
        start   (1.1490495 0.200001 1);
        end     (3 0.200001 0);
    }
   topInlet
    {
        type    lineCell;
        axis    xyz;
        start   (0 0.999999 0);
        end     (0.6 0.999999 0);
    }
   topRamp
    {
        type    lineCell;
        axis    xyz;
        start   (0.6 0.999999 0);
        end     (1.149495 0.799999 0);
    }
   topTunnel
    {
        type    lineCell;
        axis    xyz;
        start   (1.149495 0.799999 0);
        end     (3 0.799999 0);
    }


);

fields          ( p U );


// ************************************************************************* //
